// 1) необходимо разработать пользовательский элемент,
// который отображает кол-во дней минут и секунд до дедлайна и описание дедлайна
// (что нужно сделать).

// 2) необходимо добавить интерфейс, который позволит добавлять дедлайны

// 3) дедлайны должны сохраняться в Localstorage в виде массива объектов
// и при обновлении страницы отображаться

// 5) необходимо добавить кнопку, которая будет удалять элемент с дедлайном из localstorage

// 6)* при достижени дедлайна цвет заднего фона должен меняться от зеленого к красному.
// (если есть еще сутки, то задний фон абсолютно зеленый, дедлайн просрочен, то абсолютно красный, переход должен быть постепенным).

// 7)* необходимо помимо обычного добавления дз в репу git необходимо
// опубликовать дз на github pages. Информацию о процессе можно погуглить
